-- phpMyAdmin SQL Dump
-- version 4.7.3
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Мар 31 2018 г., 18:58
-- Версия сервера: 5.6.37
-- Версия PHP: 5.5.38

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `sait`
--

-- --------------------------------------------------------

--
-- Структура таблицы `files`
--

CREATE TABLE `files` (
  `id` int(11) NOT NULL,
  `txt` longtext NOT NULL,
  `photo` varchar(255) NOT NULL,
  `authorid` int(11) NOT NULL,
  `addtime` int(11) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `files`
--

INSERT INTO `files` (`id`, `txt`, `photo`, `authorid`, `addtime`) VALUES
(1, 'фыфыфы', '/uploaddir/hard.jpg', 7, 0),
(2, 'as', '/uploaddir/hard.png', 7, 0),
(3, 'Питер(-_-)', '/uploaddir/images.jpg', 7, 0),
(4, 'доктор кто', '/uploaddir/15176698078349.jpg', 7, 0),
(5, 'тут что-то есть', '/uploaddir/151766985526898.png', 7, 0),
(6, 'кар', '/uploaddir/151887888611688.jpg', 10, 0),
(7, 'тин', '/uploaddir/151887890216925.jpg', 10, 0),
(8, 'ка', '/uploaddir/15188789145525.jpg', 10, 0),
(9, 'ок чё', '/uploaddir/151887894011410.jpg', 10, 0),
(10, 'рисунок тела', '/uploaddir/151887898618090.jpg', 10, 0),
(11, 'лето солнце жара', '/uploaddir/15188790123615.jpg', 10, 0),
(12, 'париж круасан о ля ля', '/uploaddir/15188790419827.jpg', 10, 0),
(14, 'ужастик', '/uploaddir/151887926524678.jpg', 7, 0),
(15, 'домик ик', '/uploaddir/151887935920391.jpg', 7, 0),
(16, 'что-то', '/uploaddir/1519487431306.jpg', 7, 1519487431),
(17, 'санак', '/uploaddir/152008928928727.jpg', 7, 1520089289),
(18, 'камыл', '/uploaddir/152008934814756.jpg', 7, 1520089348),
(19, 'когда попытался сбежать из изолятора', '/uploaddir/152008938925.jpg', 7, 1520089389),
(20, 'салат', '/uploaddir/15200894169295.jpg', 7, 1520089416),
(21, 'санак', '/uploaddir/152008943014300.jpg', 7, 1520089430),
(22, '*флэшбэки со смены*', '/uploaddir/152008949922750.jpg', 7, 1520089499),
(23, 'владельцы фэнсара:', '/uploaddir/15200896349604.jpg', 7, 1520089634),
(24, '*администрация фэнсара*', '/uploaddir/152008971012556.jpg', 7, 1520089710),
(25, 'камыл', '/uploaddir/152008976524941.jpg', 7, 1520089765),
(26, 'искиткеч', '/uploaddir/152008985924994.jpg', 7, 1520089859),
(27, 'безбулдырабыз', '/uploaddir/152008989313069.jpg', 7, 1520089893),
(28, 'санаковские задачи', '/uploaddir/1520089964229.jpg', 7, 1520089964),
(29, 'когда попытался сбежать из изолятора', '/uploaddir/152009004314933.jpg', 7, 1520090043),
(30, '', '/uploaddir/15200903337731.jpg', 7, 1520090333),
(31, 'гопогурочка', '/uploaddir/152009050122458.jpg', 7, 1520090501),
(32, 'санак', '/uploaddir/15219022605486.jpg', 7, 1521902260),
(33, 'санак', '/uploaddir/152190227721519.jpg', 7, 1521902277),
(34, 'санак', '/uploaddir/15219022893228.jpg', 7, 1521902289),
(35, 'санак', '/uploaddir/15219022985797.jpg', 7, 1521902298),
(36, 'санак', '/uploaddir/15219023086778.jpg', 7, 1521902308),
(37, 'санак', '/uploaddir/152190232624678.jpg', 7, 1521902326),
(38, 'санак', '/uploaddir/152190233420391.jpg', 7, 1521902334),
(39, 'санак', '/uploaddir/152190235423201.jpg', 7, 1521902354),
(40, 'санак', '/uploaddir/152190245219985.jpg', 7, 1521902452),
(41, 'ceil', '/uploaddir/152190290413181.jpg', 7, 1521902904),
(42, 'ceil', '/uploaddir/152190291112914.jpg', 7, 1521902911),
(43, 'ceil', '/uploaddir/152190291726307.jpg', 7, 1521902917),
(44, 'ceil', '/uploaddir/152190292323360.jpg', 7, 1521902923),
(45, 'ceil', '/uploaddir/15219029302681.jpg', 7, 1521902930),
(46, 'мемес', '/uploaddir/1521902961958.jpg', 7, 1521902961),
(47, 'мемес', '/uploaddir/152190296811295.jpg', 7, 1521902968),
(48, 'мемес', '/uploaddir/152190297427500.jpg', 7, 1521902974),
(49, 'мемес', '/uploaddir/152190298121813.jpg', 7, 1521902981),
(50, 'мемес', '/uploaddir/15219029907626.jpg', 7, 1521902990),
(51, 'мемес', '/uploaddir/15219030181501.jpg', 7, 1521903018),
(52, 'мемес', '/uploaddir/15219030301362.jpg', 7, 1521903030),
(53, 'мемес', '/uploaddir/152190304828707.jpg', 7, 1521903048),
(54, 'мемес', '/uploaddir/152190306415031.jpg', 7, 1521903064),
(55, 'мемес', '/uploaddir/152190307129220.jpg', 7, 1521903071),
(56, 'мемес', '/uploaddir/152190308116781.jpg', 7, 1521903081),
(57, 'мемес', '/uploaddir/15219031053906.jpg', 7, 1521903105),
(58, 'мемес', '/uploaddir/152190311119283.jpg', 7, 1521903111),
(59, 'мемес', '/uploaddir/15219031193216.jpg', 7, 1521903119),
(60, 'мемес', '/uploaddir/152190312927017.jpg', 7, 1521903129),
(61, 'мемес', '/uploaddir/152190314723950.jpg', 7, 1521903147),
(62, 'мемес', '/uploaddir/152190315818863.jpg', 7, 1521903158),
(63, 'Ильсияр апа', '/uploaddir/152190318325020.jpg', 7, 1521903183),
(64, 'Ляйсан апа', '/uploaddir/15219031995445.jpg', 7, 1521903199),
(65, 'Игорь абый', '/uploaddir/152190321217562.jpg', 7, 1521903212),
(66, 'Миляш', '/uploaddir/152190322220939.jpg', 7, 1521903222),
(67, 'мемес', '/uploaddir/15219032401532.jpg', 7, 1521903240),
(68, 'шаурма', '/uploaddir/15225094751483.jpg', 7, 1522509475),
(69, 'шаурма', '/uploaddir/1522509475424.jpg', 7, 1522509475),
(70, 'шаурма', '/uploaddir/15225094755313.jpg', 7, 1522509475),
(71, 'шаурма', '/uploaddir/152250947521606.jpg', 7, 1522509475),
(72, 'шаурма', '/uploaddir/152250947513223.jpg', 7, 1522509475),
(73, 'шаурма', '/uploaddir/15225094754180.jpg', 7, 1522509475),
(74, 'шаурма', '/uploaddir/152250947515357.jpg', 7, 1522509475),
(75, 'шаурма', '/uploaddir/152250947520722.jpg', 7, 1522509475),
(76, 'шаурма', '/uploaddir/152250947525411.jpg', 7, 1522509475),
(77, 'шаурма', '/uploaddir/152250947524000.jpg', 7, 1522509475),
(78, '', '/uploaddir/1522509596361.jpg', 7, 1522509596),
(79, '', '/uploaddir/152250959618414.jpg', 7, 1522509596),
(80, '', '/uploaddir/152250959621647.jpg', 7, 1522509596),
(81, '', '/uploaddir/152250959617180.jpg', 7, 1522509596),
(82, '', '/uploaddir/152250959619237.jpg', 7, 1522509596),
(83, '', '/uploaddir/152250959629946.jpg', 7, 1522509596),
(84, '', '/uploaddir/152250959610923.jpg', 7, 1522509596),
(85, '', '/uploaddir/152250959629960.jpg', 7, 1522509596),
(86, '', '/uploaddir/152250959629857.jpg', 7, 1522509596),
(87, '', '/uploaddir/152250959626310.jpg', 7, 1522509596),
(88, 'салкаш', '/uploaddir/15225096595780.jpg', 7, 1522509659),
(89, 'салкаш', '/uploaddir/152250965925917.jpg', 7, 1522509659),
(90, 'салкаш', '/uploaddir/152250965924882.jpg', 7, 1522509659),
(91, 'салкаш', '/uploaddir/152250965920099.jpg', 7, 1522509659),
(92, 'салкаш', '/uploaddir/15225096592048.jpg', 7, 1522509659),
(93, 'салкаш', '/uploaddir/15225096596201.jpg', 7, 1522509659),
(94, 'салкаш', '/uploaddir/152250965924190.jpg', 7, 1522509659),
(95, 'салкаш', '/uploaddir/152250965920447.jpg', 7, 1522509659),
(96, 'салкаш', '/uploaddir/15225096599260.jpg', 7, 1522509659),
(97, 'салкаш', '/uploaddir/152250965932501.jpg', 7, 1522509659),
(98, 'лимонный сок', '/uploaddir/152250972425738.jpg', 7, 1522509724),
(99, 'лимонный сок', '/uploaddir/15225097242811.jpg', 7, 1522509724),
(100, 'лимонный сок', '/uploaddir/152250972422296.jpg', 7, 1522509724),
(101, 'лимонный сок', '/uploaddir/15225097245489.jpg', 7, 1522509724),
(102, 'лимонный сок', '/uploaddir/152250972416214.jpg', 7, 1522509724),
(103, 'лимонный сок', '/uploaddir/152250972423511.jpg', 7, 1522509724),
(104, 'лимонный сок', '/uploaddir/152250972419652.jpg', 7, 1522509724),
(105, 'лимонный сок', '/uploaddir/15225097246061.jpg', 7, 1522509724),
(106, 'лимонный сок', '/uploaddir/152250972431458.jpg', 7, 1522509724),
(107, 'лимонный сок', '/uploaddir/152250972424179.jpg', 7, 1522509724),
(108, 'санак', '/uploaddir/152250979928976.jpg', 7, 1522509799),
(109, 'санак', '/uploaddir/1522509799425.jpg', 7, 1522509799),
(110, 'санак', '/uploaddir/152250979925390.jpg', 7, 1522509799),
(111, 'санак', '/uploaddir/152250979928367.jpg', 7, 1522509799),
(112, 'санак', '/uploaddir/152250979928764.jpg', 7, 1522509799),
(113, 'санак', '/uploaddir/15225097993941.jpg', 7, 1522509799),
(114, 'санак', '/uploaddir/15225097991082.jpg', 7, 1522509799),
(115, 'санак', '/uploaddir/152250979910475.jpg', 7, 1522509799),
(116, 'санак', '/uploaddir/152250979913896.jpg', 7, 1522509799),
(117, 'санак', '/uploaddir/152250979915585.jpg', 7, 1522509799),
(118, 'очпочмак', '/uploaddir/15225098696905.jpg', 7, 1522509869),
(119, 'очпочмак', '/uploaddir/15225098692622.jpg', 7, 1522509869),
(120, 'очпочмак', '/uploaddir/152250986928831.jpg', 7, 1522509869),
(121, 'очпочмак', '/uploaddir/15225098695612.jpg', 7, 1522509869),
(122, 'очпочмак', '/uploaddir/152250986928085.jpg', 7, 1522509869),
(123, 'очпочмак', '/uploaddir/15225098693146.jpg', 7, 1522509869),
(124, 'очпочмак', '/uploaddir/152250986930651.jpg', 7, 1522509869),
(125, 'очпочмак', '/uploaddir/15225098699432.jpg', 7, 1522509869),
(126, 'очпочмак', '/uploaddir/152250986912337.jpg', 7, 1522509869),
(127, 'очпочмак', '/uploaddir/15225098698982.jpg', 7, 1522509869);

-- --------------------------------------------------------

--
-- Структура таблицы `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `login` varchar(32) NOT NULL,
  `email` varchar(50) NOT NULL,
  `password` varchar(32) NOT NULL,
  `FirstName` varchar(32) NOT NULL,
  `LastName` varchar(32) NOT NULL,
  `regtime` int(11) NOT NULL,
  `lasttime` int(11) NOT NULL,
  `hash` varchar(32) NOT NULL,
  `image2` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `user`
--

INSERT INTO `user` (`id`, `login`, `email`, `password`, `FirstName`, `LastName`, `regtime`, `lasttime`, `hash`, `image2`) VALUES
(7, 'asas', 'vividady@mail.ru', 'baa7a52965b99778f38ef37f235e9053', 'Алёна', 'Ярцева', 1512228501, 1512228501, '19f4d63d03b703606758f18a8141b4f0', '/uploaddir/15194863128416.jpg'),
(9, '', '', '', '', '', 0, 0, '', 'ане.png'),
(10, '16', 'galdildam@mail.ru', 'c74d97b01eae257e44aa9d5bade97baf', 'Диляра', 'Галиуллина', 1518878808, 1518878808, '5ef872fd8ec2614e178b2793255c6c4d', '/uploaddir/151887885525035.jpg');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `files`
--
ALTER TABLE `files`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_login` (`login`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `files`
--
ALTER TABLE `files`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=128;
--
-- AUTO_INCREMENT для таблицы `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
